// Задача 5.
// Дано кількість секунд, що пройшла від початку доби. Визначити скільки це годин і хвилин.

// Крок 0. Позначення величин
// seconds - кількість секунд, що пройшла від початку доби
// minutes - кількість хвилин, що пройшла від початку доби
// hours - кількість годин, що пройшла від початку доби

// Крок 1. Введення необхідних даних
const seconds = parseInt(
	prompt("Скільки пройшло секунд від початку доби", "50000")
);

// Крок 2. Обчислення результатів
const hours = Math.floor(seconds / 3600);
const minutes = Math.floor((seconds % 3600) / 60);

// Крок 3. Виведення результатів
document.write(`
<p>Від початку доби пройшло ${seconds} сек., тобто: <strong>${hours} год. ${minutes} хв. </strong></p>
`);
