// Задача 5.
//З клавіатури вводиться назва категорії водія (А-мотоцикл, В-легковий автомобіль, С-вантажний автомобіль).
// Вивести на екран назву транспортного засобу, яким він може керувати.

// Крок 0. Позначення величин
//driverCategory - назва категорії водія

if (confirm("Почати тестування?")) {
	// Крок 1. Введення необхідних даних
	const driverCategory = prompt(
		"Введіть назву категорією водія: A, B, C",
		"A"
	).toLocaleUpperCase();

	// Крок 2. Обчислення та виведення результатів

	switch (driverCategory) {
		case "A":
			document.write(`
		<p>Категрія - ${driverCategory}.</p>
		<p>Ви можете керувати мотоциклом.</p>`);
			break;

		case "B":
			document.write(`
		<p>Категрія - ${driverCategory}.</p>
		<p>Ви можете керувати легковим автомобілем.</p>`);
			break;

		case "C":
			document.write(`
		<p>Категрія - ${driverCategory}.</p>
		<p>Ви можете керувати вантажним автомобілем.</p>`);
			break;
		default:
			document.write(`
		<p>Нажаль такої категорії не аснує.</p>
		`);
			break;
	}
}
